Notes/2_PraxisTeil.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2016-09-13 Di 21:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Systemanalyse</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Vision</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Es wäre schon, wenn eine Möglichkeit hätte direkt aus einem Flow Design Diagramm den Code zu generieren, der sich aus dem Schaubild ableiten lässt.
Wenn man nun indem erzeugten Code weiter arbeitet und möglicherweise auch die Struktur wieder abändert, so wäre es auch komfortabel diesen wieder zurück in ein Flow Design zu 
verwandeln.
Die große Vision besteht also darin, einen "Roundtrip" zu erschaffen:
Erzeugen eines Flow Design Diagrammes in einem Editor -&gt; Automatisches Erzeugen von Code -&gt; Code einlesen und automatisch ein Flow Design Diagramm erzeugen.
</p>

<p>
Beim Erzeugen des Codes geht es darum, die Methoden-Signaturen zu erzeugen und im Falle von Integrationen, sogar die Implementationen.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Schwierigkeiten eines Roundtrips</h3>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Alternative Lösung von zu schwiergen Problemen, Einschränkungen</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Attribute als Hilfe zum Identifizieren von Funktionen.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Der Editor</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Brainstroming</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Gute Usability in Anlehnung an Node-basierte Grafik Anwendungen.
Es gibt einige Andwendungen, speziell in Grafikanwendungen, die sich schon seit vielen Jahren auf Node-basierte Editoren konzentrieren.
Diese dienen als gute Inspiration, wie eine gute Useability aussehen kann.
In diesem Fall wurden das Compositing-Programm The Foundary Nuke und das 3dsmax Plugin Thinking Particles als Inspiration herangezogen.
</p>

<ul class="org-ul">
<li>Einkreisen/ Gruppieren in Klassen
</li>
<li>Erzeugen von Nodes, Beschriften, Bewegen
</li>
<li>Selektieren (Rect-Selection, Subtraktion, Addition),
</li>
<li>Duplizieren, 
</li>
<li>Eingliedern von neuen Nodes in bestehende.
</li>
<li>Anordenen, automatisches Spacing
</li>
<li>Keyboard-Shortcuts zum effizenteren Arbeiten.
</li>
<li>Integrationen Innere Flows darunter darstellen
</li>
<li>Integrationen wenn zu wenig Platz um Inneren Flow darunter dazustellen, dann automtisch in neues Flow Design
</li>
<li>Einkreisen/ Gruppieren in Klassen
</li>
<li>Drucken / Exportieren als PDF in weiß auf schwarz Farbschema
</li>
</ul>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> weiter Ideen</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Implementation Previewen mit Maus-over
</li>
<li>Tests dranhängen an Node, Kommentare dranhängen,
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Vorstellung was erreicht wurde</h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Diagramm ➔ Code</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Vorstellung Roslyn</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Vorstellung was erreicht wurde</h3>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Code ➔ Diagramm</h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Schwierigkeiten, Ausblick und Fazit</h2>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Systemanalyse</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Vision</a></li>
<li><a href="#sec-1-2">1.2. Schwierigkeiten eines Roundtrips</a></li>
<li><a href="#sec-1-3">1.3. Alternative Lösung von zu schwiergen Problemen, Einschränkungen</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Der Editor</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Brainstroming</a></li>
<li><a href="#sec-2-2">2.2. Vorstellung was erreicht wurde</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Diagramm ➔ Code</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Vorstellung Roslyn</a></li>
<li><a href="#sec-3-2">3.2. Vorstellung was erreicht wurde</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Code ➔ Diagramm</a></li>
<li><a href="#sec-5">5. Schwierigkeiten, Ausblick und Fazit</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Created: 2016-09-13 Di 21:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.3.5)</p>
</div>
</footer>
</body>
</html>
