Notes/2_PraxisTeil.tex
% Created 2016-09-14 Mi 14:18
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 8.3.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Systemanalyse}
\label{sec:orgheadline4}

\subsection{Vision}
\label{sec:orgheadline1}
Es wäre schon, wenn eine Möglichkeit hätte direkt aus einem Flow Design Diagramm den Code zu generieren, der sich aus dem Schaubild ableiten lässt.
Wenn man nun indem erzeugten Code weiter arbeitet und möglicherweise auch die Struktur wieder abändert, so wäre es auch komfortabel diesen wieder zurück in ein Flow Design zu 
verwandeln.
Die große Vision besteht also darin, einen "Roundtrip" zu erschaffen:
Erzeugen eines Flow Design Diagrammes in einem Editor -> Automatisches Erzeugen von Code -> Code einlesen und automatisch ein Flow Design Diagramm erzeugen.

Beim Erzeugen des Codes geht es darum, die Methoden-Signaturen zu erzeugen und im Falle von Integrationen, sogar die Implementationen.

\subsection{Schwierigkeiten eines Roundtrips}
\label{sec:orgheadline2}


\subsection{Alternative Lösung von zu schwiergen Problemen, Einschränkungen}
\label{sec:orgheadline3}
Attribute als Hilfe zum Identifizieren von Funktionen.

\section{Der Editor}
\label{sec:orgheadline8}
\subsection{Brainstroming}
\label{sec:orgheadline6}
Gute Usability in Anlehnung an Node-basierte Grafik Anwendungen.
Es gibt einige Andwendungen, speziell in Grafikanwendungen, die sich schon seit vielen Jahren auf Node-basierte Editoren konzentrieren.
Diese dienen als gute Inspiration, wie eine gute Useability aussehen kann.
In diesem Fall wurden das Compositing-Programm The Foundary Nuke und das 3dsmax Plugin Thinking Particles als Inspiration herangezogen.

\begin{itemize}
\item Einkreisen/ Gruppieren in Klassen
\item Erzeugen von Nodes, Beschriften, Bewegen
\item Selektieren (Rect-Selection, Subtraktion, Addition),
\item Duplizieren,
\item Eingliedern von neuen Nodes in bestehende.
\item Anordenen, automatisches Spacing
\item Keyboard-Shortcuts zum effizenteren Arbeiten.
\item Integrationen Innere Flows darunter darstellen
\item Integrationen wenn zu wenig Platz um Inneren Flow darunter dazustellen, dann automtisch in neues Flow Design
\item Einkreisen/ Gruppieren in Klassen
\item Drucken / Exportieren als PDF in weiß auf schwarz Farbschema
\end{itemize}

\subsubsection{weiter Ideen}
\label{sec:orgheadline5}
\begin{itemize}
\item Implementation Previewen mit Maus-over
\item Tests dranhängen an Node, Kommentare dranhängen,
\end{itemize}
\subsection{Vorstellung was erreicht wurde}
\label{sec:orgheadline7}
\section{Diagramm ➔ Code}
\label{sec:orgheadline11}
\subsection{Vorstellung Roslyn}
\label{sec:orgheadline9}
\subsection{Vorstellung was erreicht wurde}
\label{sec:orgheadline10}
\section{Code ➔ Diagramm}
\label{sec:orgheadline12}
\section{Schwierigkeiten, Ausblick und Fazit}
\label{sec:orgheadline13}
\end{document}
